Delans-TLE/src/InformationRegisters/ES_Delans_Доступ/ES_Delans_Доступ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ES_Delans_Доступ</name>
  <resources>
    <name>Доступен</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>КрайнийСрок</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <dimensions>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Delans-TLE/src/InformationRegisters/ES_CоответствиеПравилОбменаОборудованияOfflineИКурьеров/ES_CоответствиеПравилОбменаОборудованияOfflineИКурьеров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ES_CоответствиеПравилОбменаОборудованияOfflineИКурьеров</name>
  <comment>Хранит комбинацию ПравилоОбмена - Сотрудник(курьер)</comment>
  <resources>
    <name>Курьер</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </resources>
  <resources>
    <name>ID</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </resources>
  <resources>
    <name>АдресСервера</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ИмяБазы</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </resources>
  <resources>
    <name>Пароль</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>SSL</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ТипАдреса</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Оборудование</name>
    <type>
      <types>CatalogRef.ПодключаемоеОборудование</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Delans-TLE/src/Enums/ES_ВидыСтартовыхНастроек/ES_ВидыСтартовыхНастроек.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ES_ВидыСтартовыхНастроек</name>
  <enumValues>
    <name>ВидЗабора</name>
  </enumValues>
  <enumValues>
    <name>ВидОплаты</name>
  </enumValues>
  <enumValues>
    <name>ДеньДоставки</name>
  </enumValues>
  <enumValues>
    <name>ДопКассаНП</name>
  </enumValues>
  <enumValues>
    <name>КассаНаложенныхПлатежей</name>
  </enumValues>
  <enumValues>
    <name>Организация</name>
  </enumValues>
  <enumValues>
    <name>ОсновнойГород</name>
  </enumValues>
  <enumValues>
    <name>Плательщик</name>
  </enumValues>
  <enumValues>
    <name>РозничныйПокупатель</name>
  </enumValues>
  <enumValues>
    <name>СмсСервисЛогин</name>
  </enumValues>
  <enumValues>
    <name>СмсСервисПароль</name>
  </enumValues>
  <enumValues>
    <name>СмсСервисСервер</name>
  </enumValues>
  <enumValues>
    <name>УслугаДоставки</name>
  </enumValues>
  <enumValues>
    <name>УслугаРКО</name>
  </enumValues>
  <enumValues>
    <name>УслугаСамовывоза</name>
  </enumValues>
  <enumValues>
    <name>УслугаСтраховки</name>
  </enumValues>
  <enumValues>
    <name>Характеристика</name>
  </enumValues>
  <enumValues>
    <name>Удалить_ИспользоватьГрузы</name>
    <comment>НЕ ИСПОЛЬЗУЕТСЯ</comment>
  </enumValues>
  <enumValues>
    <name>Удалить_ИспользоватьЗабор</name>
    <comment>НЕ ИСПОЛЬЗУЕТСЯ</comment>
  </enumValues>
  <enumValues>
    <name>Метка1ВремяС</name>
  </enumValues>
  <enumValues>
    <name>Метка2ВремяС</name>
  </enumValues>
  <enumValues>
    <name>Метка3ВремяС</name>
  </enumValues>
  <enumValues>
    <name>Метка1ВремяПо</name>
  </enumValues>
  <enumValues>
    <name>Метка2ВремяПо</name>
  </enumValues>
  <enumValues>
    <name>Метка3ВремяПо</name>
  </enumValues>
  <enumValues>
    <name>Метка1Цвет</name>
  </enumValues>
  <enumValues>
    <name>Метка2Цвет</name>
  </enumValues>
  <enumValues>
    <name>Метка3Цвет</name>
  </enumValues>
  <enumValues>
    <name>ОтражатьВремяНаКарте</name>
  </enumValues>
  <enumValues>
    <name>СистемаОпределенияКоординат</name>
  </enumValues>
  <enumValues>
    <name>ПроцентСтраховки</name>
  </enumValues>
  <enumValues>
    <name>Коэффициент</name>
    <comment>Коэффициент расчета объемного веса</comment>
  </enumValues>
  <enumValues>
    <name>ES_Переключатель</name>
  </enumValues>
  <enumValues>
    <name>ES_FTPСервер</name>
  </enumValues>
  <enumValues>
    <name>ES_FTPПорт</name>
  </enumValues>
  <enumValues>
    <name>ES_Пользователь</name>
  </enumValues>
  <enumValues>
    <name>ES_Пароль</name>
  </enumValues>
  <enumValues>
    <name>ES_Каталог</name>
  </enumValues>
  <enumValues>
    <name>ПоискЗаказовПоВхНакладной</name>
    <comment>Истина - При поиске по штрихкоду заказы подбираются по Вх накладной,  Ложь - По НомеруНакладной</comment>
  </enumValues>
  <enumValues>
    <name>АвтоПринятКурьером</name>
    <comment>При создании плана заказам автоматически присваивается статус &quot;Принят курьером&quot;</comment>
  </enumValues>
  <enumValues>
    <name>АвтоПриемЗаборов</name>
  </enumValues>
  <enumValues>
    <name>Склад</name>
  </enumValues>
  <enumValues>
    <name>ГруппаДляГрузов</name>
  </enumValues>
  <enumValues>
    <name>Метка1Код</name>
  </enumValues>
  <enumValues>
    <name>Метка2Код</name>
  </enumValues>
  <enumValues>
    <name>Метка3Код</name>
  </enumValues>
  <enumValues>
    <name>КодСкладДвери</name>
  </enumValues>
  <enumValues>
    <name>КодДвериДвери</name>
  </enumValues>
  <enumValues>
    <name>КодДвериДвериУпрощенный</name>
  </enumValues>
  <enumValues>
    <name>КодСамовывоз</name>
  </enumValues>
  <enumValues>
    <name>КодДвериТерминал</name>
  </enumValues>
  <enumValues>
    <name>КодТерминалТерминал</name>
  </enumValues>
  <enumValues>
    <name>НоменклатураДляЧека</name>
  </enumValues>
  <enumValues>
    <name>ИспользоватьНоменклатуруДляЧеков</name>
  </enumValues>
  <enumValues>
    <name>ВидДоставки</name>
  </enumValues>
  <enumValues>
    <name>ОтражатьДДуНаКарте</name>
  </enumValues>
  <enumValues>
    <name>УслугаСбора</name>
  </enumValues>
  <enumValues>
    <name>ЯчейкаОсновная</name>
  </enumValues>
  <enumValues>
    <name>ЯчейкаКВыдаче</name>
  </enumValues>
  <enumValues>
    <name>ЯчейкаПроблема</name>
  </enumValues>
  <enumValues>
    <name>КодТерминалПВЗ</name>
  </enumValues>
  <enumValues>
    <name>ШаблонСообщенияДляСбора</name>
  </enumValues>
  <enumValues>
    <name>ШаблонСообщенияДляЗаказа</name>
  </enumValues>
  <enumValues>
    <name>ТокенБотаДляТелеграм</name>
  </enumValues>
  <enumValues>
    <name>ИДЧатаДляТелеграм</name>
  </enumValues>
  <enumValues>
    <name>ШаблонСообщенияДляВидаЗаказа</name>
  </enumValues>
  <enumValues>
    <name>ЛогинПользователяИБ</name>
  </enumValues>
  <enumValues>
    <name>ПарольПользователяИБ</name>
  </enumValues>
  <enumValues>
    <name>АдресСклада</name>
  </enumValues>
  <enumValues>
    <name>АдресСкладаДолгота</name>
  </enumValues>
  <enumValues>
    <name>АдресСкладаШирота</name>
  </enumValues>
</mdclass:Enum>

Delans-TLE/src/Catalogs/СтруктурныеЕдиницы/СтруктурныеЕдиницы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>СтруктурныеЕдиницы</name>
  <hierarchical>true</hierarchical>
  <hierarchyType>HierarchyOfItems</hierarchyType>
  <predefined>
    <items>
      <name>ОсновноеПодразделение</name>
      <description>Основное подразделение</description>
    </items>
    <items>
      <name>ОсновнойСклад</name>
      <description>Основной склад</description>
    </items>
  </predefined>
  <attributes>
    <name>ТипСтруктурнойЕдиницы</name>
    <type>
      <types>EnumRef.ТипыСтруктурныхЕдиниц</types>
    </type>
  </attributes>
  <attributes>
    <name>ОрдерныйСклад</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>МОЛ</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>ПодписьМОЛ</name>
    <comment>Подпись материально-ответственного лица</comment>
    <type>
      <types>CatalogRef.Подписи</types>
    </type>
  </attributes>
  <attributes>
    <name>РозничныйВидЦен</name>
    <type>
      <types>CatalogRef.ВидыЦен</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетУчетаВРознице</name>
    <type>
      <types>ChartOfAccountsRef.Управленческий</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетУчетаНаценки</name>
    <type>
      <types>ChartOfAccountsRef.Управленческий</types>
    </type>
  </attributes>
  <attributes>
    <name>ИсточникПеремещения</name>
    <type>
      <types>CatalogRef.СтруктурныеЕдиницы</types>
    </type>
  </attributes>
  <attributes>
    <name>ЯчейкаИсточникаПеремещения</name>
    <type>
      <types>CatalogRef.Ячейки</types>
    </type>
  </attributes>
  <attributes>
    <name>ПолучательПеремещения</name>
    <type>
      <types>CatalogRef.СтруктурныеЕдиницы</types>
    </type>
  </attributes>
  <attributes>
    <name>ЯчейкаПолучателяПеремещения</name>
    <type>
      <types>CatalogRef.Ячейки</types>
    </type>
  </attributes>
  <attributes>
    <name>ПолучательОтходов</name>
    <type>
      <types>CatalogRef.СтруктурныеЕдиницы</types>
    </type>
  </attributes>
  <attributes>
    <name>ЯчейкаПолучателяОтходов</name>
    <type>
      <types>CatalogRef.Ячейки</types>
    </type>
  </attributes>
  <attributes>
    <name>ИсточникСписанияНаРасходы</name>
    <type>
      <types>CatalogRef.СтруктурныеЕдиницы</types>
    </type>
  </attributes>
  <attributes>
    <name>ЯчейкаИсточникаСписанияНаРасходы</name>
    <type>
      <types>CatalogRef.Ячейки</types>
    </type>
  </attributes>
  <attributes>
    <name>ПолучательСписанияНаРасходы</name>
    <type>
      <types>CatalogRef.СтруктурныеЕдиницы</types>
    </type>
  </attributes>
  <attributes>
    <name>ЯчейкаПолучателяСписанияНаРасходы</name>
    <type>
      <types>CatalogRef.Ячейки</types>
    </type>
  </attributes>
  <attributes>
    <name>ИсточникПередачиВЭксплуатацию</name>
    <type>
      <types>CatalogRef.СтруктурныеЕдиницы</types>
    </type>
  </attributes>
  <attributes>
    <name>ЯчейкаИсточникаПередачиВЭксплуатацию</name>
    <type>
      <types>CatalogRef.Ячейки</types>
    </type>
  </attributes>
  <attributes>
    <name>ПолучательПередачиВЭксплуатацию</name>
    <type>
      <types>CatalogRef.СтруктурныеЕдиницы</types>
    </type>
  </attributes>
  <attributes>
    <name>ЯчейкаПолучателяПередачиВЭксплуатацию</name>
    <type>
      <types>CatalogRef.Ячейки</types>
    </type>
  </attributes>
  <attributes>
    <name>ИсточникВозвратаИзЭксплуатации</name>
    <type>
      <types>CatalogRef.СтруктурныеЕдиницы</types>
    </type>
  </attributes>
  <attributes>
    <name>ЯчейкаИсточникаВозвратаИзЭксплуатации</name>
    <type>
      <types>CatalogRef.Ячейки</types>
    </type>
  </attributes>
  <attributes>
    <name>ПолучательВозвратаИзЭксплуатации</name>
    <type>
      <types>CatalogRef.СтруктурныеЕдиницы</types>
    </type>
  </attributes>
  <attributes>
    <name>ЯчейкаПолучателяВозвратаИзЭксплуатации</name>
    <type>
      <types>CatalogRef.Ячейки</types>
    </type>
  </attributes>
  <attributes>
    <name>ES_Партнер</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>УсловияХранения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ГоловнаяОрганизация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>КПП</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>9</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеПолное</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ЦифровойИндексОбособленногоПодразделения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>5</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>КонтактнаяИнформация</name>
    <attributes>
      <name>Тип</name>
      <type>
        <types>EnumRef.ТипыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Вид</name>
      <type>
        <types>CatalogRef.ВидыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Представление</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗначенияПолей</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Страна</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Регион</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Город</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АдресЭП</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДоменноеИмяСервера</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефона</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефонаБезКодов</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Delans-TLE/src/CommonModules/ES_БиллингСервер/Module.bsl
Функция ИдентификаторСервисаDelans () Экспорт
	
	Возврат  "a651a222-1ec7-4582-9c62-052b1bd50b96";
	
КонецФункции

Функция ИдентификаторУслугиМенеджерDelans() Экспорт
	
	Возврат "258fc5bb-8376-40ea-ad33-2d3e10d08a5d";
	
КонецФункции

Функция ИдентификаторУслугиКурьерDelans() Экспорт
	
	Возврат "6bc1dc0f-5eac-425b-b80d-fb973df19108";
	
КонецФункции

Функция ИдентификаторУслугиTelegram() Экспорт
	
	Возврат "0199AC9F-2185-483D-9D39-38625FE5519A";
	
КонецФункции

Функция АдресСервераDelans() Экспорт
	
	Возврат "unf.42clouds.com";
	
КонецФункции

Функция ИмяБазыDelans() Экспорт
	
	Возврат СтрЗаменить("unf_base1/"+ПараметрыСеанса.ОбластьДанныхЗначение, " ", "");
	
КонецФункции


Функция ПроверкаДостпуностиСервисаПриСтартеРаботыСистемы() Экспорт
	
	ТестоваяСреда = ES_ОбщегоНазначенияКлиентСервер.ЭтоТестоваяСреда(); 
	
	Если НЕ ОбщегоНазначения.РазделениеВключено() ИЛИ НЕ ОбщегоНазначения.ДоступноИспользованиеРазделенныхДанных() 
		ИЛИ ТестоваяСреда Тогда
		Возврат Новый Структура("ДоступПолучен, КрайнийСрок", Истина, Дата("39991231"));
	КонецЕсли;
	
	ИДСервиса = ES_БиллингСервер.ИдентификаторСервисаDelans();
	ТекПользователь = Пользователи.ТекущийПользователь();
	ПользовательИБ = ОпределитьПользователяИБ(ТекПользователь);
	
	Если ПользовательИБ = Неопределено ИЛИ ТипЗнч(ПользовательИБ) = Тип("Строка") Тогда
		Возврат Новый Структура("ДоступПолучен, КрайнийСрок", Истина, Дата("39991231"));
	КонецЕсли;
	
	Логин = СокрЛП(ПользовательИБ.Имя);
	
	ТекстОшибки = "";	
	ОтветСервиса = CTSM_Efsol_Платформа.ПолучитьИнформациюДляПартнераОСостоянииСервиса(ИДСервиса, Логин, ТекстОшибки);
	
	СтрокаОтвет = "";
	СтруктураОтвета = ОбработатьОтветсСервиса(ОтветСервиса, ТекстОшибки, ТекПользователь);
	
	Возврат СтруктураОтвета;
	
КонецФункции

Функция ОпределитьПользователяИБ(ТекущийПользователь) Экспорт
	
	УИНПользователя     = ТекущийПользователь.ИдентификаторПользователяИБ;
	
	Попытка
		
		ПользовательИБ = ПользователиИнформационнойБазы.НайтиПоУникальномуИдентификатору(УИНПользователя);
			
	Исключение
		ПользовательИБ = "Не найден";
	КонецПопытки;
	
	Возврат ПользовательИБ;
	
КонецФункции

Функция ОбработатьОтветсСервиса(ОтветСервиса, Знач ТекстОшибки, ТекущийПользователь)
	
	 СтруктураОтвета = Новый Структура;
	 СтруктураОтвета.Вставить("ДоступПолучен", Ложь);
	 СтруктураОтвета.Вставить("Сообщение", "");
	 СтруктураОтвета.Вставить("КрайнийСрок",Дата("00010101")); 
	 ДоступПолучен = Ложь;
	 Сообщение = "";
	 КрайнийСрок = Дата("00010101");
	 СервисДоступен = Ложь;
	 Если НЕ ПустаяСтрока(ТекстОшибки) Тогда
		 ДоступПолучен = Ложь;
		 Сообщение = ТекстОшибки;
	 ИначеЕсли ТипЗнч(ОтветСервиса) = Тип("Структура") Тогда
		 
		 Если ОтветСервиса.Свойство("ServiceIsActive") Тогда
			 СервисДоступен = Врег(ОтветСервиса.ServiceIsActive) = Врег("true");
		 КонецЕсли;
		 
		 Если ОтветСервиса.Свойство("ServiceExpiredDate") Тогда
			 КрайнийСрок = ПреобразоватьСтрокуВДату(ОтветСервиса.ServiceExpiredDate);
		 КонецЕсли;
		 
		 Если СервисДоступен Тогда
			 Если ОтветСервиса.Свойство("EnabledServiceTypesList") Тогда
				 Если ТипЗнч(ОтветСервиса.EnabledServiceTypesList) = Тип("Массив") Тогда
					 Если ОтветСервиса.EnabledServiceTypesList.Найти(ИдентификаторУслугиМенеджерDelans()) <> Неопределено Тогда
						ДоступПолучен = Истина;	 
					 КонецЕсли;
				 КонецЕсли;
			 КонецЕсли;
		 КонецЕсли;
		 
		 
	 Иначе
		 ДоступПолучен = Ложь;
		 Сообщение = ОтветСервиса;
	 КонецЕсли;
	
	СтруктураОтвета.ДоступПолучен 	= ДоступПолучен;
	СтруктураОтвета.Сообщение	  	= Сообщение;
	СтруктураОтвета.КрайнийСрок		= КрайнийСрок;
	
	ДобавитьЗаписьВРегистрДоступов(ДоступПолучен, КрайнийСрок, ТекущийПользователь);		
	
	Возврат СтруктураОтвета;
КонецФункции

Процедура ДобавитьЗаписьВРегистрДоступов(ДоступПолучен, КрайнийСрок, ТекущийПользователь)

	МенеджерЗаписи = РегистрыСведений.ES_Delans_Доступ.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Доступен	= ДоступПолучен;
	МенеджерЗаписи.КрайнийСрок	= КрайнийСрок;
	МенеджерЗаписи.Пользователь = ТекущийПользователь;
	МенеджерЗаписи.Записать(Истина);

КонецПроцедуры

Функция ПроверитьДоступностьСервисаDelans() Экспорт
	
	ДоступПолучен = Ложь;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ES_Delans_Доступ.Доступен КАК Доступен
		|ИЗ
		|	РегистрСведений.ES_Delans_Доступ КАК ES_Delans_Доступ
		|ГДЕ
		|	ES_Delans_Доступ.Пользователь = &Пользователь";
	
	Запрос.УстановитьПараметр("Пользователь", Пользователи.ТекущийПользователь());
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		ДоступПолучен = Выборка.Доступен;	
	КонецЦикла;
	
	Возврат ДоступПолучен;		
	
КонецФункции


Функция ПреобразоватьСтрокуВДату(ДатаСтрокой)
	
	Возврат ES_Mobile.ПреобразоватьСтрокуВДату(ДатаСтрокой);
	
КонецФункции

#Область ПроверкаДоступностиУслугиTelegram

Функция ПроверкаДоступностиУслугиТелеграмм() Экспорт
	
	ТестоваяСреда = ES_ОбщегоНазначенияКлиентСервер.ЭтоТестоваяСреда();
	Если НЕ ОбщегоНазначения.РазделениеВключено() ИЛИ НЕ ОбщегоНазначения.ДоступноИспользованиеРазделенныхДанных() 
		ИЛИ ТестоваяСреда Тогда
		Возврат Истина;
	КонецЕсли;
	ИДУслуги = ИдентификаторУслугиTelegram();
	ТекПользователь = Пользователи.ТекущийПользователь();
	ПользовательИБ = ОпределитьПользователяИБ(ТекПользователь);
	Если ПользовательИБ = Неопределено ИЛИ ТипЗнч(ПользовательИБ) = Тип("Строка") Тогда
		Возврат Ложь;
	КонецЕсли;

	Логин = СокрЛП(ПользовательИБ.Имя);
	
	ТекстОшибки = "";	
	ОтветСервиса = CTSM_Efsol_Платформа.УслугаСервисаПодключена(ИДУслуги, Логин, ТекстОшибки);
	
	Если ОтветСервиса = Неопределено Тогда
		Сообщить(ТекстОшибки);
	Иначе
		Возврат ОтветСервиса;
	КонецЕсли;
		
КонецФункции

#КонецОбласти

#Область РаботаСМобильнымПриложениемDelans_ЗаполнениеСпискаКурьеров
Процедура ЗаполнитьСписокПользователейСУслугойКурьерDelans()   Экспорт
	
	ПользователиСДоступнойУслугой = Новый Массив;
	
	Если НЕ ПроверитьДоступностьРаботыПодключаемогоОборудования() Тогда
		Сообщить("В настройках не включено использование подключаемого оборудования и обмена с подключаемым оборудованием");
		Возврат;
	КонецЕсли;
	
	Попытка
		
		HTTPConnectionCore = CTSM_EfsolУниверсальныеФункцииСервер.HTTPConnection("Core");
		
		ПользовательИБ = ES_БиллингСервер.ОпределитьПользователяИБ(Пользователи.ТекущийПользователь());
		Логин = СокрЛП(ПользовательИБ);
		//Логин = "lks-kargo";
		//1) получаем ID юзера по логину
		АдресРесурса = "api_v2/AccountUsers/GetIdByLogin?login="+Логин;
		ПараметрыОтвета = CTSM_EfsolУниверсальныеФункцииКлиентСервер.ВыполнитьЗапрос(HTTPConnectionCore, АдресРесурса, "Get");
		Если ПараметрыОтвета.КодОтвета = 200 Тогда
			IDТекЮзера = ПараметрыОтвета.СтруктураОтвета.AccountUserID;
		Иначе
			Возврат; 
		КонецЕсли;
		
		//2) получаем ID акаунта по ID Юзера
		АдресРесурса = "api_v2/AccountUsers/GetAccountId?accountUserId="+IDТекЮзера;
		ПараметрыОтвета = CTSM_EfsolУниверсальныеФункцииКлиентСервер.ВыполнитьЗапрос(HTTPConnectionCore, АдресРесурса, "Get");
		Если ПараметрыОтвета.КодОтвета = 200 Тогда
			IDАккаунта = ПараметрыОтвета.СтруктураОтвета.AccountID;
		Иначе
			Возврат; 
		КонецЕсли;
		
		//3) получаем список ID Юзеров по ID Аккаунта
		АдресРесурса = "api_v2/AccountUsers/GetIDs?accountID="+IDАккаунта;
		ПараметрыОтвета = CTSM_EfsolУниверсальныеФункцииКлиентСервер.ВыполнитьЗапрос(HTTPConnectionCore, АдресРесурса, "Get");
		Если ПараметрыОтвета.КодОтвета = 200 Тогда
			МассивIDЮзеров = ПараметрыОтвета.СтруктураОтвета.AccountUserIDs;
		Иначе
			Возврат; 
		КонецЕсли;
		
		ИдентификаторУслугиКурьерDelans = ES_БиллингСервер.ИдентификаторУслугиКурьерDelans();
		//4) для каждого id Юзера аккаунта проверяем доступность услуги "Курьер Деланс". Для этого
		Для каждого IDЮзера ИЗ МассивIDЮзеров Цикл
			//4.1) получаем логин юзера по ID
			АдресРесурса = "api_v2/AccountUsers/GetLogin?accountUserID="+IDЮзера;
			ПараметрыОтвета = CTSM_EfsolУниверсальныеФункцииКлиентСервер.ВыполнитьЗапрос(HTTPConnectionCore, АдресРесурса, "Get");
			Если ПараметрыОтвета.КодОтвета = 200 Тогда
				ЛогинЮзера = ПараметрыОтвета.СтруктураОтвета.Login;
			Иначе
				Возврат; 
			КонецЕсли;
			//4.2) проверяем доступность услуги по логину юзера
			АдресРесурса = "api_v2/PartnerServicesData/CheckServiceTypeStatusForUserByLogin?serviceTypeId="
			+ИдентификаторУслугиКурьерDelans+"&accountUserLogin=" + ЛогинЮзера;
			ПараметрыОтвета = CTSM_EfsolУниверсальныеФункцииКлиентСервер.ВыполнитьЗапрос(HTTPConnectionCore, АдресРесурса, "Get");
			Если ПараметрыОтвета.КодОтвета = 200 Тогда
				ДоступПолучен = ПараметрыОтвета.СтруктураОтвета.Result;
			Иначе
				Возврат; 
			КонецЕсли;
			
			Если ДоступПолучен Тогда
				ПользователиСДоступнойУслугой.Добавить(ЛогинЮзера);
			КонецЕсли;
			
		КонецЦикла;	
		
	Исключение
		Сообщить("Ошибка выполнения запроса в Ядро.");
		Возврат;
	КонецПопытки;
	
	
	Если ПользователиСДоступнойУслугой.Количество() > 0 Тогда
		ПравилоОбмена = НайтиСоздатьПравилоОбмена();
		Если ПравилоОбмена = Неопределено Тогда
			Возврат;
		КонецЕсли;
		НайтиСоздатьПодключаемоеОборудование(ПользователиСДоступнойУслугой, ПравилоОбмена);
	КонецЕсли;
	
КонецПроцедуры

Функция ПроверитьДоступностьРаботыПодключаемогоОборудования ()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ИспользоватьОбменСПодключаемымОборудованиемOffline.Значение КАК ИспользоватьОбменСПодключаемымОборудованиемOffline,
	|	ФункциональнаяОпцияИспользоватьПодключаемоеОборудование.Значение КАК ФункциональнаяОпцияИспользоватьПодключаемоеОборудование
	|ИЗ
	|	Константа.ИспользоватьОбменСПодключаемымОборудованиемOffline КАК ИспользоватьОбменСПодключаемымОборудованиемOffline,
	|	Константа.ФункциональнаяОпцияИспользоватьПодключаемоеОборудование КАК ФункциональнаяОпцияИспользоватьПодключаемоеОборудование";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Если Выборка.ИспользоватьОбменСПодключаемымОборудованиемOffline И
			Выборка.ФункциональнаяОпцияИспользоватьПодключаемоеОборудование Тогда
			Возврат Истина;
		Иначе
			Возврат Ложь;
		КонецЕсли;
		
	КонецЦикла;
		
КонецФункции

Функция НайтиСоздатьПравилоОбмена()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
	|	ПравилаОбменаСПодключаемымОборудованиемOffline.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.ПравилаОбменаСПодключаемымОборудованиемOffline КАК ПравилаОбменаСПодключаемымОборудованиемOffline
	|ГДЕ
	|	ПравилаОбменаСПодключаемымОборудованиемOffline.ТипПодключаемогоОборудования = ЗНАЧЕНИЕ(перечисление.ТипыПодключаемогоОборудования.ККМОфлайн)
	|	И НЕ ПравилаОбменаСПодключаемымОборудованиемOffline.ПометкаУдаления";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если НЕ РезультатЗапроса.Пустой() Тогда
		ПравилоОбъект = РезультатЗапроса.Выгрузить()[0].Ссылка.ПолучитьОбъект();
	Иначе
		ПравилоОбъект = Справочники.ПравилаОбменаСПодключаемымОборудованиемOffline.СоздатьЭлемент();
	КонецЕсли;
	
	ПравилоОбъект.ТипПодключаемогоОборудования = Перечисления.ТипыПодключаемогоОборудования.ККМОфлайн;
	ПравилоОбъект.Наименование	=	ПроверитьЗаполнениеЗначения(ПравилоОбъект.Наименование,"Правило обмена");
	ПравилоОбъект.СтруктурнаяЕдиница = ПроверитьЗаполнениеЗначения(ПравилоОбъект.СтруктурнаяЕдиница, Справочники.СтруктурныеЕдиницы.ОсновнойСклад);
	ПравилоОбъект.ПрефиксВесовогоТовара = ПроверитьЗаполнениеЗначения(ПравилоОбъект.ПрефиксВесовогоТовара, 1);
	ПравилоОбъект.ВыгружатьИзменения	= Истина;
	ПравилоОбъект.Организация 			= ПроверитьЗаполнениеЗначения(ПравилоОбъект.Организация,ES_ОбщегоНазначения.ПолучитьСтартовуюНастройку(Перечисления.ES_ВидыСтартовыхНастроек.Организация));
	ПравилоОбъект.ВидЦеныНоменклатуры	= ПроверитьЗаполнениеЗначения(ПравилоОбъект.ВидЦеныНоменклатуры, Справочники.ВидыЦен.Оптовая);
	
	Попытка
		ПравилоОбъект.Записать();
		Возврат ПравилоОбъект.Ссылка;
	Исключение
		Сообщить("Не удалось записать правило обмена");
		Возврат Неопределено;
	КонецПопытки;
	
КонецФункции

Процедура НайтиСоздатьПодключаемоеОборудование(МассивИдентификаторов, ПравилоОбмена)
	
	Если ПравилоОбмена = Неопределено Тогда
		Возврат;
	КонецЕсли;
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ПодключаемоеОборудование.Ссылка КАК Ссылка,
		|	ПодключаемоеОборудование.ИдентификаторWebСервисОборудования КАК ИдентификаторWebСервисОборудования
		|ИЗ
		|	Справочник.ПодключаемоеОборудование КАК ПодключаемоеОборудование
		|ГДЕ
		|	ПодключаемоеОборудование.ИдентификаторWebСервисОборудования В(&ИдентификаторWebСервисОборудования)
		|	И ПодключаемоеОборудование.ВидТранспортаОфлайнОбмена = ЗНАЧЕНИЕ(Перечисление.ВидыТранспортаОфлайнОбмена.WS)";
	
	Запрос.УстановитьПараметр("ИдентификаторWebСервисОборудования", МассивИдентификаторов);
	
	ТЗ = Запрос.Выполнить().Выгрузить();
	
	ДрайверОборудования = Справочники.ДрайверыОборудования.Драйвер1СККМOffline;
	Если ЗначениеЗаполнено(ПравилоОбмена.Организация) Тогда
		Организация = ПравилоОбмена.Организация;
	Иначе
		Организация = ES_ОбщегоНазначения.ПолучитьСтартовуюНастройку(Перечисления.ES_ВидыСтартовыхНастроек.Организация);
	КонецЕсли;
	
	ТекРабочееМесто = МенеджерОборудованияВызовСервера.ПолучитьРабочееМестоКлиента();
	
	Для каждого ИдентификаторУстройства Из МассивИдентификаторов Цикл
		СтруктураОтбора = Новый Структура;
		СтруктураОтбора.Вставить("ИдентификаторWebСервисОборудования",ИдентификаторУстройства);
		
		НайтиСтроки = ТЗ.НайтиСтроки(СтруктураОтбора);
		Если НайтиСтроки.Количество() > 0 Тогда
			ОборудованиеОбъект  = НайтиСтроки[0].Ссылка.ПолучитьОбъект();
		Иначе
			ОборудованиеОбъект = Справочники.ПодключаемоеОборудование.СоздатьЭлемент();
		Конецесли;
		
		ОборудованиеОбъект.ВидТранспортаОфлайнОбмена = Перечисления.ВидыТранспортаОфлайнОбмена.WS;
		ОборудованиеОбъект.ИдентификаторWebСервисОборудования	= ИдентификаторУстройства;
		ОборудованиеОбъект.Наименование 						= ИдентификаторУстройства;
		ОборудованиеОбъект.ДрайверОборудования 					= Справочники.ДрайверыОборудования.Драйвер1СККМOffline;
		ОборудованиеОбъект.Организация 							= Организация;
		ОборудованиеОбъект.РабочееМесто							= ТекРабочееМесто;
		ОборудованиеОбъект.СпособФорматноЛогическогоКонтроля	= Перечисления.СпособыФорматноЛогическогоКонтроля.РазделятьСтроки;
		ОборудованиеОбъект.ДопустимоеРасхождениеФорматноЛогическогоКонтроля	=	0.01;
		ОборудованиеОбъект.ТипОборудования		= Перечисления.ТипыПодключаемогоОборудования.ККМОфлайн;
		ОборудованиеОбъект.ТипОфлайнОборудования	= Перечисления.ТипыОфлайнОборудования.ККМ;
		ОборудованиеОбъект.ПравилоОбмена			= ПравилоОбмена;
		Если Не ЗначениеЗаполнено(ОборудованиеОбъект.УзелИнформационнойБазы) Тогда
			ОборудованиеОбъект.УзелИнформационнойБазы = СоздатьУзелОбмена(ИдентификаторУстройства);
		КонецЕсли;	
		ОборудованиеОбъект.УстройствоИспользуется		= Истина;
		ОборудованиеОбъект.Записать();
		
		ДобавитьЗаписьВРегистрСоответствияОборудованияИКурьеров(ОборудованиеОбъект.Ссылка);
		
	КонецЦикла;
		
КонецПроцедуры

Процедура ДобавитьЗаписьВРегистрСоответствияОборудованияИКурьеров(Оборудование)
	
	НаборЗаписей = РегистрыСведений.ES_CоответствиеПравилОбменаОборудованияOfflineИКурьеров.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Оборудование.Установить(Оборудование);
	НаборЗаписей.Прочитать();
	
	ТЗ = НаборЗаписей.Выгрузить();
	
	Если ТЗ.Количество() = 0 Тогда
		НовСтр = ТЗ.Добавить();
	Иначе
		НовСтр = ТЗ[0];
	КонецЕсли;
	
	НовСтр.Оборудование = Оборудование;
	НовСтр.АдресСервера = ES_БиллингСервер.АдресСервераDelans();
	НовСтр.ИмяБазы		= ES_БиллингСервер.ИмяБазыDelans();
	НовСтр.ТипАдреса	= 3;
	НовСтр.SSL			= Истина;
	НаборЗаписей.Загрузить(ТЗ);
	НаборЗаписей.Записать(Истина);
		
КонецПроцедуры

Функция СоздатьУзелОбмена(ИдентификаторУстройства) 
	
	УзелОбъект = ПланыОбмена.ОбменСПодключаемымОборудованиемOffline.НайтиПоНаименованию(ИдентификаторУстройства);
	Если ЗначениеЗаполнено(УзелОбъект) Тогда
		УзелОбъект = УзелОбъект.ПолучитьОбъект();
	Иначе
		УзелОбъект = ПланыОбмена.ОбменСПодключаемымОборудованиемOffline.СоздатьУзел();
	КонецЕсли;
	
	УзелОбъект.Наименование = ИдентификаторУстройства;
	УзелОбъект.ОбластьДанныхОсновныеДанные = ПараметрыСеанса.ОбластьДанныхЗначение;
	УзелОбъект.ЭтотУзел 	= Ложь;
	Попытка
	
		УзелОбъект.Записать();
	    УлезСсылка = УзелОбъект.Ссылка;
	Исключение
	   УлезСсылка = ПланыОбмена.ОбменСПодключаемымОборудованиемOffline.ПустаяСсылка();
   КонецПопытки;
   
   Возврат  УлезСсылка;
	
КонецФункции

Функция ПроверитьЗаполнениеЗначения(ПроверяемоеЗначение, НовоеЗначение)
	
	Если ЗначениеЗаполнено(ПроверяемоеЗначение) Тогда
		Возврат ПроверяемоеЗначение;
	Иначе
		Возврат НовоеЗначение;
	КонецЕсли;
	
КонецФункции

#КонецОбласти
